<template>
  <div>
    <h1> Тестовое задание на вакансию  Frontend разработчика</h1>
    <p>
      Необходимо реализовать интерфейс просмотра и заказа условного товара на Vue.js
    </p>

    <h2>КАТАЛОГ</h2>
    <ul>
      <li> 	В разделе «Каталог» реализовать отображение списка условного товара с фильтрацией по цвету и стоимости в диапазоне цены.
      </li>
      <li> 	Товар, отсеянный по условиям фильтра, не должен отображаться пользователю.
      </li>
      <li> 	Если ни один товар не удовлетворяет условиям, вывести надпись «Товар не найден» под фильтром.
      </li>
      <li> 	Анимация фильтрации не обязательна.
      </li>
      <li> 	Состояние фильтра должно сохраняться при навигации между разделами.
      </li>
      <li> 	Счетчик корзины должен отображать актуальное количество выбранного товара.
      </li>
      <li> 	Файл со списком товара и изображениями прилагается к заданию.
      </li>
    </ul>


    <h2>О НАС</h2>

    <p>
       Раздел «О нас» содержит условное описание производителя.
    </p>
    <p>
        Переход по ссылке «О нас» в меню заголовка.
    </p>




    <h2>КОРЗИНА</h2>
    <ul>
      <li>	Переход в раздел «Корзина» осуществляется по ссылке «Корзина» в правой части заголовка.
      </li>
      <li>	Содержит список выбранного пользователем товара, с возможностью удаления, и форму заказа.
      </li>
      <li>	Если поля не заполнены, при попытке оформления заказа должен выдаваться alert о необходимости заполнить все поля.
      </li>
      <li>	Если корзина пуста, вывести под заголовком надпись «Для заказа выберите и добавьте товар в корзину».
      </li>
      <li>	Форма должна быть скрыта.
      </li>
      <li>	В обратном случае, если форма удовлетворяет всем условиям, через 5 (пять) секунд вывести alert «Ваша заявка принята»,
      </li>
      <li>	после чего необходимо очистить список товаров в корзине с примененем всех сопутствующих данному состоянию условий.
      </li>
    </ul>

<ul>
  <li>	Макет прилагается в формате png.
  </li>
  <li>	Все размеры и расстояния условны, точного соответствия не требуется, достаточно, чтобы интерфейс в целом соответствовал макету, но содержал все указанные элементы.
  </li>
  <li>	Макет носит рекомендательный характер, при необходимости возможно внедрение своих элементов и стилей.
  </li>
  <li>	Адаптив не является обязательным, но будет плюсом.
  </li>
</ul>

    <ul>
      <li>	Подвал приложения, при недостаточной высоте контента, должен прибиваться к нижней кромке области видимости браузера.
      </li>
      <li>	При верстке следует использовать методолгию БЭМ.
      </li>
      <li>	Использование препроцессоров обязательно.
      </li>
      <li>	Использование шаблонизаторов по желанию, но так же будет плюсом.
      </li>
      <li>	Структура приложения и используемые инструменты на усмотрение кандидата.
      </li>
      <li>	Страница должна работать в IE10+ и основных современных браузерах (chrome, safari, opera, firefox).
      </li>
    </ul>

  </div>

</template>

<script>
    export default {
        name: "Main"
    }

</script>

<style scoped>

</style>
